
* Counting words

We can try to decipher the message in /ori/ by trying to find any surprisingly frequent "words". For various biological processes, certain nucleotide strings often appear surprisingly in various biological processes. This is often because certain proteins can only bind to DNA if a specific string of nucleotides is present, and if there are more occurrences of the string, then it is more likely that binding will successfully occur. (It is also less likely that a mutation will disrupt the binding process.)

=k-mer=: A string of length /k/
=Count(Text, Pattern)=: A function returning the number of times that a =k-mer Pattern= appears as a *substring* of =Text=. This includes overlapping text.

Here is our (first!) Nim code implementing this naive algorithm:

#+begin_src nim :tangle chapter1.nim
proc patternCount*(text: string, pattern: string): int =
  var count = 0

  # I use `high` here instead of `len` because of ease of use.
  for idx in 0..text.high - pattern.len:
    if text[idx .. idx+pattern.high] == pattern:
        count += 1

  result = count

#+end_src

#+RESULTS:
: 3

